app/controllers/fridges_controller.rb

    def show
        id = params[:id]
        @fridge = Fridge.find(id)
---
SELECT  "fridges".* FROM "fridges" WHERE "fridges"."id" = ? LIMIT 1  [["id", 1]]

    def index
        @fridges = Fridge.all
---
SELECT "fridges".* FROM "fridges"

    def create
        @fridge = Fridge.new(params[:movie])
        if @fridge.save
---
INSERT INTO "fridges" ("menu", "ingredient", "recipe", "rating", "where", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["menu", ""], ["ingredient", ""], ["recipe", ""], ["rating", "1"], ["where", "Africa"], ["created_at", "2018-11-09 08:23:50.874958"], ["updated_at", "2018-11-09 08:23:50.874958"]]

    def edit
        @fridge = Fridge.find params[:id]
---
SELECT  "fridges".* FROM "fridges" WHERE "fridges"."id" = ? LIMIT 1  [["id", 1]]

    def update
        @fridge = Fridge.find params[:id]
        if @fridge.update_attributes(params[:fridge])
---
SELECT  "fridges".* FROM "fridges" WHERE "fridges"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "fridges" SET "menu" = ?, "recipe" = ?, "where" = ?, "updated_at" = ? WHERE "fridges"."id" = ?  [["menu", "Kimchi jjigae"], ["recipe", "df"], ["where", "Asia"], ["updated_at", "2018-11-09 08:54:36.621021"], ["id", 3]]

    def destroy
        @fridge = Fridge.find(params[:id])
        @fridge.destroy
---
SELECT  "fridges".* FROM "fridges" WHERE "fridges"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "fridges" WHERE "fridges"."id" = ?  [["id", 2]]