app/controllers/main_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def main
    @recipes = Recipe.all

INSERT INTO "recipes" ("menu", "ingredient", "recipe", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["menu", "haha"], ["ingredient", "haha"], ["recipe", "haha"], ["created_at", "2018-11-25 19:59:57.842426"], ["updated_at", "2018-11-25 19:59:57.842426"]]
---
  def create
    recipe = Recipe.new
    recipe.menu = params[:menu]
    recipe.ingredient = params[:ingredient]
    recipe.recipe = params[:recipe]
    recipe.country = params[:country]
    recipe.rate = params[:rate]
    recipe.save