app/controllers/sessions_controller.rb

SELECT "usergoers"."id" FROM "usergoers" WHERE "usergoers"."provider" = ? AND "usergoers"."uid" = ?  [["provider", "twitter"], ["uid", "960973551070273536"]]
---
    def create
        auth=request.env["omniauth.auth"]
        user=Usergoer.where(:provider => auth["provider"], :uid => auth["uid"]) ||
            Usergoer.create_with_omniauth(auth)